---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.OverallSize
source: html/a81937bd-a160-759c-79c2-9329607d9850.htm
---
# Autodesk.Revit.DB.FabricationPart.OverallSize Property

The overall size of the fabrication part.

## Syntax (C#)
```csharp
public string OverallSize { get; }
```